src/main/resources/templates/smartpay/SmartpayOrderSubmitTemplate.xml

<?xml version="1.0"?>
<soap:Envelope
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:ns1="http://payment.services.adyen.com"
        xmlns:ns2="http://common.services.adyen.com">
    <soap:Body>
        <ns1:authorise>
            <ns1:paymentRequest>
                <ns1:amount>
                    <ns2:currency>GBP</ns2:currency>
                    <ns2:value>${amount}</ns2:value>
                </ns1:amount>
                <ns1:card>
                    <ns1:cvc>${card.cvc}</ns1:cvc>
                    <ns1:expiryMonth>${card.endDate?split('/')?first}</ns1:expiryMonth>
                    <ns1:expiryYear>20${card.endDate?split('/')?last}</ns1:expiryYear>
                    <ns1:holderName>${card.cardHolder?xml}</ns1:holderName>
                    <ns1:number>${card.cardNo}</ns1:number>
                    <ns1:billingAddress>
                        <ns2:houseNumberOrName>${card.address.line1?xml}</ns2:houseNumberOrName>
                        <#if card.address.line2??>
                        <ns2:street>${card.address.line2?xml}</ns2:street>
                        </#if>
                        <ns2:postalCode>${card.address.postcode?xml}</ns2:postalCode>
                        <#if card.address.county??>
                        <ns2:stateOrProvince>${card.address.county?xml}</ns2:stateOrProvince>
                        </#if>
                        <ns2:city>${card.address.city?xml}</ns2:city>
                        <ns2:country>${card.address.country?xml}</ns2:country>
                    </ns1:billingAddress>
                </ns1:card>
                <ns1:merchantAccount>${merchantCode}</ns1:merchantAccount>
                <ns1:reference>${paymentPlatformReference?xml}</ns1:reference>
                <ns1:shopperReference>${description?xml}</ns1:shopperReference>
            </ns1:paymentRequest>
        </ns1:authorise>
    </soap:Body>
</soap:Envelope>
